Revit 2024 API
View3D.ToggleToPerspective Method
 Toggles this view to perspective.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public void ToggleToPerspective()
Visual Basic
Public Sub ToggleToPerspective
Visual C++
public:
void ToggleToPerspective()
Remarks
 This view can only be toggled to perspective if no view specific elements are contained.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This view cannot be toggled.
See Also
View3D Class
Autodesk.Revit.DB Namespace